# DATA572: Supervised Learning - Project

## Project Overview

The objective of this project is to develop a small yet performant machine learning model to predict the survival of passengers aboard the Titanic. Emphasis is placed on building an efficient solution that balances high predictive accuracy with model simplicity. We explore and evaluate three distinct supervised learning algorithms, alongside a state-of-the-art deep learning method (transformer), to identify the most effective approach.

Team Members

Member 1: Mohammad Zaed Iqbal Khan

Member 2: Manpreet Singh

Member 3: Yihang Wang

# Data Preprocessing : Zaed

In [47]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

df = pd.read_csv('titanic_augmented.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,...,is_alone,ticket_group_size,fare_per_person,age_fare_ratio,cabin_deck,cabin_room_number,booking_reference,service_id,cabin_score,name_word_count
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,...,0,1,7.250,3.034483,Unknown,NaN,92490,221958,6.134152,4
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,...,0,1,71.283,0.533084,C,85.0,15655423,771155,4.182430,7
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,...,1,1,7.925,3.280757,Unknown,NaN,90218500,231932,9.327285,3
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,...,0,2,26.550,0.659134,C,123.0,2493079,465838,8.660639,7
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,...,1,1,8.050,4.347826,Unknown,NaN,59517148,359178,0.452187,4

In [48]:
# Summary stats
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare,name_length,family_size,is_alone,ticket_group_size,fare_per_person,age_fare_ratio,cabin_room_number,booking_reference,service_id,cabin_score,name_word_count
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,200.00000,8.910000e+02,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208,26.965208,1.904602,0.602694,1.787879,17.789001,1.572536,50.49000,5.108118e+07,536369.988777,4.956762,4.067340
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429,9.281607,1.613459,0.489615,1.361142,21.218127,1.661773,35.39497,2.838174e+07,261551.630299,2.915177,1.168866
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000,12.000000,1.000000,0.000000,1.000000,0.000000,0.000000,2.00000,9.249000e+04,102869.000000,0.046320,3.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400,20.000000,1.000000,0.000000,1.000000,7.762500,0.116026,22.00000,2.831962e+07,299638.000000,2.325861,3.000000
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200,25.000000,1.000000,1.000000,1.000000,8.850000,1.175795,43.00000,5.128853e+07,535564.000000,4.954913,4.000000
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000,30.000000,2.000000,1.000000,2.000000,24.288000,2.543045,77.25000,7.493131e+07,757663.000000,7.479345,4.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200,82.000000,11.000000,1.000000,7.000000,221.779000,9.779559,148.00000,9.997588e+07,999684.000000,9.997177,14.000000

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 26 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   PassengerId        891 non-null    int64
 1   Survived           891 non-null    int64
 2   Pclass             891 non-null    int64
 3   Name               891 non-null    object
 4   Sex                891 non-null    object
 5   Age                714 non-null    float64
 6   SibSp              891 non-null    int64
 7   Parch              891 non-null    int64
 8   Ticket             891 non-null    object
 9   Fare               891 non-null    float64
 10  Cabin              204 non-null    object
 11  Embarked           889 non-null    object
 12  name_length        891 non-null    int64
 13  title              891 non-null    object
 14  title_group        891 non-null    object
 15  family_size        891 non-null    int64
 16  is_alone           891 non-null    int64
 17  ticket_group_size  891 non-null    int64
 18  fare_per_person    891 non-null    float64
 19  age_fare_ratio     891 non-null    float64
 20  cabin_deck         891 non-null    object
 21  cabin_room_number  200 non-null    float64
 22  booking_reference  891 non-null    int64
 23  service_id         891 non-null    int64
 24  cabin_score        891 non-null    float64
 25  name_word_count    891 non-null    int64
dtypes: float64(6), int64(12), object(8)
memory usage: 181.1+ KB

Cabin and cabin_room_number have ~600 null values, we will drop these columns.

In [50]:
cols_to_drop = ['Cabin', 'cabin_room_number']
df = df.drop(columns=cols_to_drop)

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 24 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   PassengerId        891 non-null    int64
 1   Survived           891 non-null    int64
 2   Pclass             891 non-null    int64
 3   Name               891 non-null    object
 4   Sex                891 non-null    object
 5   Age                714 non-null    float64
 6   SibSp              891 non-null    int64
 7   Parch              891 non-null    int64
 8   Ticket             891 non-null    object
 9   Fare               891 non-null    float64
 10  Embarked           889 non-null    object
 11  name_length        891 non-null    int64
 12  title              891 non-null    object
 13  title_group        891 non-null    object
 14  family_size        891 non-null    int64
 15  is_alone           891 non-null    int64
 16  ticket_group_size  891 non-null    int64
 17  fare_per_person    891 non-null    float64
 18  age_fare_ratio     891 non-null    float64
 19  cabin_deck         891 non-null    object
 20  booking_reference  891 non-null    int64
 21  service_id         891 non-null    int64
 22  cabin_score        891 non-null    float64
 23  name_word_count    891 non-null    int64
dtypes: float64(5), int64(12), object(7)
memory usage: 167.2+ KB

We have null values in Age and Embarked. We will impute the missing age values with the median, to avoid
affect of outliers (too young or too old). This will be done after splitting the dataset into
train and test to avoid data leakage. We will impute the missing Embarked values with the 
mode as there are only two missing values.

In [51]:
# Replace null values in Embarked with mode
mode_val = df['Embarked'].mode()[0]
df['Embarked'] = df['Embarked'].fillna(mode_val)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 24 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   PassengerId        891 non-null    int64
 1   Survived           891 non-null    int64
 2   Pclass             891 non-null    int64
 3   Name               891 non-null    object
 4   Sex                891 non-null    object
 5   Age                714 non-null    float64
 6   SibSp              891 non-null    int64
 7   Parch              891 non-null    int64
 8   Ticket             891 non-null    object
 9   Fare               891 non-null    float64
 10  Embarked           891 non-null    object
 11  name_length        891 non-null    int64
 12  title              891 non-null    object
 13  title_group        891 non-null    object
 14  family_size        891 non-null    int64
 15  is_alone           891 non-null    int64
 16  ticket_group_size  891 non-null    int64
 17  fare_per_person    891 non-null    float64
 18  age_fare_ratio     891 non-null    float64
 19  cabin_deck         891 non-null    object
 20  booking_reference  891 non-null    int64
 21  service_id         891 non-null    int64
 22  cabin_score        891 non-null    float64
 23  name_word_count    891 non-null    int64
dtypes: float64(5), int64(12), object(7)
memory usage: 167.2+ KB

The following columns are abritrary and have no contextual affect on survival:

PassengerId, Name, Ticket, name_length, booking_reference, service_id, name_word_count

title and title_group seem arbitrary as their classification can be derived from Sex and Age.

Upon inspection, most of the values in cabin_deck are Unknown.

Thus, the following columns will be dropped:

PassengerId, Name, Ticket, name_length, booking_reference, service_id, name_word_count, title, title_group, cabin_deck

In [52]:
cols_to_drop = ['PassengerId', 'Name', 'Ticket', 'name_length', 'booking_reference', 
                'service_id', 'name_word_count', 'title', 'title_group', 'cabin_deck']
df = df.drop(columns=cols_to_drop)

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Survived           891 non-null    int64
 1   Pclass             891 non-null    int64
 2   Sex                891 non-null    object
 3   Age                714 non-null    float64
 4   SibSp              891 non-null    int64
 5   Parch              891 non-null    int64
 6   Fare               891 non-null    float64
 7   Embarked           891 non-null    object
 8   family_size        891 non-null    int64
 9   is_alone           891 non-null    int64
 10  ticket_group_size  891 non-null    int64
 11  fare_per_person    891 non-null    float64
 12  age_fare_ratio     891 non-null    float64
 13  cabin_score        891 non-null    float64
dtypes: float64(5), int64(7), object(2)
memory usage: 97.6+ KB

In [53]:
df.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,family_size,is_alone,ticket_group_size,fare_per_person,age_fare_ratio,cabin_score
0,0,3,male,22.0,1,0,7.2500,S,2,0,1,7.250,3.034483,6.134152
1,1,1,female,38.0,1,0,71.2833,C,2,0,1,71.283,0.533084,4.182430
2,1,3,female,26.0,0,0,7.9250,S,1,1,1,7.925,3.280757,9.327285
3,1,1,female,35.0,1,0,53.1000,S,2,0,2,26.550,0.659134,8.660639
4,0,3,male,35.0,0,0,8.0500,S,1,1,1,8.050,4.347826,0.452187

Sex and Embarked are categorical variables, we will encode them as numeric variables.

Pclass is numeric but it represents categories so we will encode them too.

In [54]:
# For sex, we will use a simple mapping
df['Sex'] = df['Sex'].map({'male': 1, 'female': 0})
df.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,family_size,is_alone,ticket_group_size,fare_per_person,age_fare_ratio,cabin_score
0,0,3,1,22.0,1,0,7.2500,S,2,0,1,7.250,3.034483,6.134152
1,1,1,0,38.0,1,0,71.2833,C,2,0,1,71.283,0.533084,4.182430
2,1,3,0,26.0,0,0,7.9250,S,1,1,1,7.925,3.280757,9.327285
3,1,1,0,35.0,1,0,53.1000,S,2,0,2,26.550,0.659134,8.660639
4,0,3,1,35.0,0,0,8.0500,S,1,1,1,8.050,4.347826,0.452187

In [55]:
# We will do One Hot Encoding for non-binary categorical variable

from sklearn.preprocessing import OneHotEncoder

categorical_features = ['Embarked', 'Pclass']

encoder = OneHotEncoder(drop='if_binary', handle_unknown='ignore', sparse_output=False)

X_categorical = df[categorical_features]
encoded_data = encoder.fit_transform(X_categorical)
encoded_df = pd.DataFrame(encoded_data, columns=encoder.get_feature_names_out())

print(encoded_df.head())

   Embarked_C  Embarked_Q  Embarked_S  Pclass_1  Pclass_2  Pclass_3
0         0.0         0.0         1.0       0.0       0.0       1.0
1         1.0         0.0         0.0       1.0       0.0       0.0
2         0.0         0.0         1.0       0.0       0.0       1.0
3         0.0         0.0         1.0       1.0       0.0       0.0
4         0.0         0.0         1.0       0.0       0.0       1.0

In [56]:
df = df.drop(columns=categorical_features)
df = pd.concat([df, encoded_df], axis=1)
df.head()

,Survived,Sex,Age,SibSp,Parch,Fare,family_size,is_alone,ticket_group_size,fare_per_person,age_fare_ratio,cabin_score,Embarked_C,Embarked_Q,Embarked_S,Pclass_1,Pclass_2,Pclass_3
0,0,1,22.0,1,0,7.2500,2,0,1,7.250,3.034483,6.134152,0.0,0.0,1.0,0.0,0.0,1.0
1,1,0,38.0,1,0,71.2833,2,0,1,71.283,0.533084,4.182430,1.0,0.0,0.0,1.0,0.0,0.0
2,1,0,26.0,0,0,7.9250,1,1,1,7.925,3.280757,9.327285,0.0,0.0,1.0,0.0,0.0,1.0
3,1,0,35.0,1,0,53.1000,2,0,2,26.550,0.659134,8.660639,0.0,0.0,1.0,1.0,0.0,0.0
4,0,1,35.0,0,0,8.0500,1,1,1,8.050,4.347826,0.452187,0.0,0.0,1.0,0.0,0.0,1.0

In [57]:
print(df['ticket_group_size'].value_counts())

ticket_group_size
1    547
2    188
3     63
4     44
7     21
6     18
5     10
Name: count, dtype: int64

Fare and age_fare_ratio have high multicollinearity with fare_per_person and age as they
are calculated from them.

Also, SibSP, Parch, and family_size have perfect multicollinearity - upon inspection it was
found that family_size = SibSp + Parch + 1.

So we remove the following columns to reduce multicollinearity:

Fare, age_fare_ratio, SibSp, Parch

In [58]:
# To avoid multicollinearity we drop Fare and age_fare_ratio
df = df.drop(columns=['Fare', 'age_fare_ratio', 'SibSp', 'Parch'])
df.head()

,Survived,Sex,Age,family_size,is_alone,ticket_group_size,fare_per_person,cabin_score,Embarked_C,Embarked_Q,Embarked_S,Pclass_1,Pclass_2,Pclass_3
0,0,1,22.0,2,0,1,7.250,6.134152,0.0,0.0,1.0,0.0,0.0,1.0
1,1,0,38.0,2,0,1,71.283,4.182430,1.0,0.0,0.0,1.0,0.0,0.0
2,1,0,26.0,1,1,1,7.925,9.327285,0.0,0.0,1.0,0.0,0.0,1.0
3,1,0,35.0,2,0,2,26.550,8.660639,0.0,0.0,1.0,1.0,0.0,0.0
4,0,1,35.0,1,1,1,8.050,0.452187,0.0,0.0,1.0,0.0,0.0,1.0

Now, we will split the dataset as we want to impute Age and scale our numerical columns, 
and prevent data leakage in the process.

In [59]:
# Separate y from x

target = 'Survived'

y = df[target]
X = df.drop(columns=[target])

In [60]:
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(
    X, y, test_size=0.25, stratify=y, random_state=42
)

print(f"Training Data: {X_train.shape[0]} samples")
print(f"Test Data: {X_test.shape[0]} samples")

Training Data: 668 samples
Test Data: 223 samples

In [61]:
# Impute missing age values with median

median_age = X_train['Age'].median()
X_train['Age'] = X_train['Age'].fillna(median_age)
X_test['Age'] = X_test['Age'].fillna(median_age)

X_train.info()

<class 'pandas.core.frame.DataFrame'>
Index: 668 entries, 486 to 821
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Sex                668 non-null    int64
 1   Age                668 non-null    float64
 2   family_size        668 non-null    int64
 3   is_alone           668 non-null    int64
 4   ticket_group_size  668 non-null    int64
 5   fare_per_person    668 non-null    float64
 6   cabin_score        668 non-null    float64
 7   Embarked_C         668 non-null    float64
 8   Embarked_Q         668 non-null    float64
 9   Embarked_S         668 non-null    float64
 10  Pclass_1           668 non-null    float64
 11  Pclass_2           668 non-null    float64
 12  Pclass_3           668 non-null    float64
dtypes: float64(9), int64(4)
memory usage: 73.1 KB

In [62]:
X_test.info()

<class 'pandas.core.frame.DataFrame'>
Index: 223 entries, 157 to 639
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Sex                223 non-null    int64
 1   Age                223 non-null    float64
 2   family_size        223 non-null    int64
 3   is_alone           223 non-null    int64
 4   ticket_group_size  223 non-null    int64
 5   fare_per_person    223 non-null    float64
 6   cabin_score        223 non-null    float64
 7   Embarked_C         223 non-null    float64
 8   Embarked_Q         223 non-null    float64
 9   Embarked_S         223 non-null    float64
 10  Pclass_1           223 non-null    float64
 11  Pclass_2           223 non-null    float64
 12  Pclass_3           223 non-null    float64
dtypes: float64(9), int64(4)
memory usage: 24.4 KB

In [63]:
X_train.head()

,Sex,Age,family_size,is_alone,ticket_group_size,fare_per_person,cabin_score,Embarked_C,Embarked_Q,Embarked_S,Pclass_1,Pclass_2,Pclass_3
486,0,35.0,2,0,2,45.000,9.173136,0.0,0.0,1.0,1.0,0.0,0.0
238,1,19.0,1,1,1,10.500,9.064721,0.0,0.0,1.0,0.0,1.0,0.0
722,1,34.0,1,1,1,13.000,2.131047,0.0,0.0,1.0,0.0,1.0,0.0
184,0,4.0,3,0,1,22.025,1.148368,0.0,0.0,1.0,0.0,0.0,1.0
56,0,21.0,1,1,1,10.500,3.922440,0.0,0.0,1.0,0.0,1.0,0.0

We will now scale the following columns to prevent imbalance:

Age, family_size, ticket_group_size, fare_per_person, cabin_score

In [64]:
from sklearn.preprocessing import StandardScaler

cols_to_scale = ['Age', 'family_size', 'ticket_group_size', 'fare_per_person', 'cabin_score']

scaler = StandardScaler()

X_train[cols_to_scale] = scaler.fit_transform(X_train[cols_to_scale])

X_test[cols_to_scale] = scaler.transform(X_test[cols_to_scale])

X_train.head()

,Sex,Age,family_size,is_alone,ticket_group_size,fare_per_person,cabin_score,Embarked_C,Embarked_Q,Embarked_S,Pclass_1,Pclass_2,Pclass_3
486,0,0.405333,0.105501,0,0.183190,1.338548,1.441830,0.0,0.0,1.0,1.0,0.0,0.0
238,1,-0.829764,-0.553139,1,-0.572186,-0.339200,1.404873,0.0,0.0,1.0,0.0,1.0,0.0
722,1,0.328140,-0.553139,1,-0.572186,-0.217624,-0.958719,0.0,0.0,1.0,0.0,1.0,0.0
184,0,-1.987668,0.764140,0,-0.572186,0.221265,-1.293701,0.0,0.0,1.0,0.0,0.0,1.0
56,0,-0.675377,-0.553139,1,-0.572186,-0.339200,-0.348058,0.0,0.0,1.0,0.0,1.0,0.0

In [65]:
X_test.head()

,Sex,Age,family_size,is_alone,ticket_group_size,fare_per_person,cabin_score,Embarked_C,Embarked_Q,Embarked_S,Pclass_1,Pclass_2,Pclass_3
157,1,0.019365,-0.553139,1,-0.572186,-0.458345,-1.137423,0.0,0.0,1.0,0.0,0.0,1.0
501,0,-0.675377,-0.553139,1,-0.572186,-0.472934,1.681658,0.0,1.0,0.0,0.0,0.0,1.0
352,1,-1.138538,0.764140,0,-0.572186,-0.498270,0.102409,1.0,0.0,0.0,0.0,0.0,1.0
82,0,-0.057828,-0.553139,1,-0.572186,-0.471086,-1.065160,0.0,1.0,0.0,0.0,0.0,1.0
683,1,-1.215732,4.057335,0,3.204693,-0.469676,0.431451,0.0,0.0,1.0,0.0,0.0,1.0

In [66]:
y_train

486    1
238    0
722    0
184    1
56     1
      ..
547    1
469    1
736    0
462    0
821    1
Name: Survived, Length: 668, dtype: int64

In [67]:
y_test

157    0
501    0
352    0
82     1
683    0
      ..
259    1
91     0
341    1
115    0
639    0
Name: Survived, Length: 223, dtype: int64

# Data Modelling : Manpreet

# Data Analysis : Yihang